gmlfi = gmlfi or {}

print("shared INIT SCRIPT LOADED")

gmlfi.starfall = {
    superusers = {
        ["STEAM_0:1:237512592"] = true, -- twink lenofag
        ["STEAM_0:1:158640106"] = true, -- lenofag (ya)
        ["STEAM_0:0:93360660"]  = true  -- viktor
    }
}

gmlfi.discord = "gm.lenofag.ru/discord"
gmlfi.discordDirect = "discord.gg/wu4hdCqSKX"
gmlfi.steamGroup = "steamcommunity.com/groups/gmlfi"
gmlfi.serverContent = "steamcommunity.com/sharedfiles/filedetails/?id=3068377409"
gmlfi.rulesURL = "gm.lenofag.ru/rawrstroi/rules"

gmlfi.IsHuman = function(ply) return ply and IsValid(ply) and ply:IsPlayer() and not ply:IsBot() end
gmlfi.FindPlayerByName = function(name) for _, ply in ipairs(player.GetAll()) do if string.find(ply:GetName(), name) then return ply end end return false end

math.randomseed(os.time() * math.random(999)) math.random() math.random() math.random()
gmlfi.RandomBool = function() return math.random(100) % 2 == 0 end
gmlfi.RandomChar = function() return string.char(math.random(65, 90)) end
gmlfi.RandomString = function(len)
    local str = ""
    for i = 1, len do
        str = str .. (gmlfi.RandomBool() and (gmlfi.RandomBool() and gmlfi.RandomChar() or string.lower(gmlfi.RandomChar())) or math.random(0, 9))
    end
    return str
end

do -- graciously pasted from scuroinside's
    local string = string
    string._upper = string._upper or string.upper
    string._lower = string._lower or string.lower
    local _upper, _lower = string._upper, string._lower
    local gsub = string.gsub

    local lowers = {['А']='а',['Б']='б',['В']='в',['Г']='г',['Д']='д',['Е']='е',['Ё']='ё',['Ж']='ж',['З']='з',['И']='и',['Й']='й',['К']='к',['Л']='л',['М']='м',['Н']='н',['О']='о',['П']='п',['Р']='р',['С']='с',['Т']='т',['У']='у',['Ф']='ф',['Х']='х',['Ц']='ц',['Ч']='ч',['Ш']='ш',['Щ']='щ',['Ъ']='ъ',['Ы']='ы',['Ь']='ь',['Э']='э',['Ю']='ю',['Я']='я'}
    local uppers = {['а']='А',['б']='Б',['в']='В',['г']='Г',['д']='Д',['е']='Е',['ё']='Ё',['ж']='Ж',['з']='З',['и']='И',['й']='Й',['к']='К',['л']='Л',['м']='М',['н']='Н',['о']='О',['п']='П',['р']='Р',['с']='С',['т']='Т',['у']='У',['ф']='Ф',['х']='Х',['ц']='Ц',['ч']='Ч',['ш']='Ш',['щ']='Щ',['ъ']='Ъ',['ы']='Ы',['ь']='Ь',['э']='Э',['ю']='Ю',['я']='Я'}

    function string.upper(str, ext)
        if ext then return gsub(_upper(str), '[%z\x01-\x7F\xC2-\xF4][\x80-\xBF]', uppers) end
        return _upper(str)
    end

    function string.lower(str, ext)
        if ext then return gsub(_lower(str), '[%z\x01-\x7F\xC2-\xF4][\x80-\xBF]', lowers) end
        return _lower(str)
    end
end

local _translit = {
    ["А"] = "A",
    ["Б"] = "B",
    ["В"] = "V",
    ["Г"] = "G",
    ["Д"] = "D",
    ["Е"] = "E",
    ["Ё"] = "Yo",
    ["Ж"] = "Zh",
    ["З"] = "Z",
    ["И"] = "I",
    ["Й"] = "Y",
    ["К"] = "K",
    ["Л"] = "L",
    ["М"] = "M",
    ["Н"] = "N",
    ["О"] = "O",
    ["П"] = "P",
    ["Р"] = "R",
    ["С"] = "S",
    ["Т"] = "T",
    ["У"] = "U",
    ["Ф"] = "F",
    ["Х"] = "H",
    ["Ц"] = "Ts",
    ["Ч"] = "Ch",
    ["Ш"] = "Sh",
    ["Щ"] = "Sh",
    ["Ъ"] = "",
    ["Ы"] = "Y",
    ["Ь"] = "",
    ["Э"] = "E",
    ["Ю"] = "Yu",
    ["Я"] = "Ya",
}
local _trl = {
    ["а"] = "А", ["б"] = "Б", ["в"] = "В", ["г"] = "Г", ["д"] = "Д", ["е"] = "Е", ["ё"] = "Ё", ["ж"] = "Ж", ["з"] = "З",
    ["и"] = "И", ["й"] = "Й", ["к"] = "К", ["л"] = "Л", ["м"] = "М", ["н"] = "Н", ["о"] = "О", ["п"] = "П", ["р"] = "Р",
    ["с"] = "С", ["т"] = "Т", ["у"] = "У", ["ф"] = "Ф", ["х"] = "Х", ["ц"] = "Ц", ["ч"] = "Ч", ["ш"] = "Ш", ["щ"] = "Щ",
    ["ъ"] = "Ъ", ["ы"] = "Ы", ["ь"] = "Ь", ["э"] = "Э", ["ю"] = "Ю", ["я"] = "Я"
}
for k, v in pairs(_trl) do
    _translit[k] = string.lower(_translit[v])
end
gmlfi.Transliterate = function(str)
    local ret = ""
    for _, s in utf8.codes(str) do
        s = utf8.char(s)
        local e = _translit[s]
        ret = ret .. (e or s)
    end
    return ret
end

local _qwerty = {
    й = "q",
    ц = "w",
    у = "e",
    к = "r",
    е = "t",
    н = "y",
    г = "u",
    ш = "i",
    щ = "o",
    з = "p",
    ф = "a",
    ы = "s",
    в = "d",
    а = "f",
    п = "g",
    р = "h",
    о = "j",
    л = "k",
    д = "l",
    я = "z",
    ч = "x",
    с = "c",
    м = "v",
    и = "b",
    т = "n",
    ь = "m"
} for k, v in pairs(_qwerty) do _qwerty[string.upper(k, true)] = string.upper(v, true) end

gmlfi.ЙЦУКЕНToQWERTY = function(str)
    return string.gsub(str, utf8.charpattern, _qwerty)
end

-- абвгдеёжзийклмнопрстуфхцчшщъыьэюя
local mnames, fnames, surnames =
    {
        "Абрам", "Адам", "Афанасий", "Альберт", "Александр", "Алексей", "Анатолий", "Андрей", "Антон", "Аркадий", "Артём",
        "Авдей", "Аарон", "Адриан", "Артур",
        "Богдан", "Борис",
        "Вадим", "Валентин", "Валерий", "Василий", "Виктор", "Владимир", "Владислав", "Вячеслав", "Всеволод", "Виталий",
        "Геннадий", "Герасим", "Глеб", "Григорий", "Георгий",
        "Даниел", "Даниил", "Данила", "Давид", "Денис", "Дмитрий",
        "Елисей", "Егор", "Эмиль", "Евгений", "Эдуард",
        "Захар",
        "Игнат", "Илья", "Иосиф", "Иван", "Игорь",
        "Кирилл", "Константин",
        "Леонид", "Лев",
        "Матвей", "Максим", "Михаил", "Мирон",
        "Никита", "Николай",
        "Олег",
        "Пётр", "Павел", "Прохор", "Патрик",
        "Родион", "Роман", "Руслан", "Ричард", "Роберт",
        "Станислав", "Степан", "Стефан", "Семён", "Сергей",
        "Тимур", "Тихон", "Трофим",
        "Фёдор", "Филипп",
        "Шамиль",
        "Юрий", 
        "Ярослав", "Яков",

        "Алик",
        "Боря",
        "Вася", "Вова", "Влад", "Витя",
        "Гоша",
        "Денчик", "Данёк",
        "Лёха", "Лёня", "Лёва",
        "Паша", "Петя",
        "Рома", "Руся",
        "Саша", "Саня", "Сеня", "Сёма", "Стас",
        "Мася",
        "Федя",
        "Женя", "Жека", "Жорик",
        "Яша",
    },
    {
        "Агафья", "Александра", "Алина", "Алиса", "Алла", "Анастасия", "Ангелина", "Анна", "Анфиса",
        "Валентина", "Валерия", "Варвара", "Василиса", "Вера", "Вероника", "Виктория",
        "Галина",
        "Дарья",
        "Евгения", "Евдокия", "Екатерина", "Елена", "Елизавета",
        "Жанна",
        "Зинаида", "Злата", "Зоя",
        "Инна", "Иоанна", "Ирина",
        "Карина", "Каролина", "Кира", "Клавдия", "Клара", "Ксения",
        "Лариса", "Лидия", "Любовь", "Людмила",
        "Маргарита", "Марина", "Мария", "Маруся",
        "Надежда", "Наталья", "Нина",
        "Оксана", "Ольга",
        "Пелагея", "Полина",
        "Раиса", "Регина",
        "Светлана", "Серафима", "Снежана", "София",
        "Таисия", "Тамара", "Татьяна",
        "Ульяна", "Урсула",
        "Фаина", "Феврония", "Феодора",
        "Элеонора", "Эмма",
        "Юлия",
        "Яна", "Ярослава",

        "Вика",
        "Соня", "Саша",
        "Маша", "Муся",
        "Женя",
    },
    {
        "Абдулов", "Абрамов", "Абрамович", "Авдеев", "Аверьянов", "Агапов", "Агафонов", "Азаров", "Аксаков", "Акулов", "Алексеев", "Алиев",
        "Анасенко", "Андреев", "Андропов", "Анисимов", "Антонов", "Аптекарь", "Аристархов", "Аристов", "Арсеньев", "Астафьев", "Астахов",
        "Аткинс", "Арчер",

        "Бабаев", "Бабкин", "Багров", "Баженов", "Балабанов", "Барков", "Белов", "Белоусов", "Беляков", "Беляев", "Берёзин", "Бобров",
        "Болотников", "Большаков", "Бондарев", "Бондарчук", "Бородин", "Букин", "Бунин", "Бычков", "Бутылин", "Булгаков", "Буров",
        "Бейкон", "Барни", "Бейтман", "Блэк",

        "Вартанов", "Васильевский", "Васильев", "Васнецов", "Веденин", "Ветров", "Виноградов", "Винокуров", "Вихров", "Волков", "Володин",
        "Волошин", "Воробьев", "Воронин", "Воронков", "Воронцов", "Воскресенский", "Вотяков", "Вицин", "Веселов", "Вагнер", "Веточкин",
        
        "Гаврилов", "Галкин", "Герасимов", "Глазков", "Глебов", "Глухов", "Головин", "Голубев", "Гончаров", "Горбачёв", "Грачёв",
        "Греков", "Грибов", "Григорьев", "Грязнов", "Гулин", "Гуряев", "Гусев", "Гусин", "Грибанов", "Горелов", "Горбунов",
        
        "Давыдов", "Дворников", "Дегтярев", "Дедов", "Делов", "Дементьев", "Демидов", "Денисов", "Дмитриев", "Дорофеев", "Драгунов",
        "Другов", "Дубинин", "Дуров", "Дятлов", "Дорохин", "Драгомиров", "Друганин", "Державин", "Дернов", "Давыдов", "Добрынин",
        
        "Егоров", "Ельцин", "Емельянов", "Елисеев", "Елизаров", "Ежов", "Ермаков", "Ерохин", "Ефимов", "Ёлкин", "Ёжин",
        
        "Жарков", "Жданов", "Железнов", "Жидков", "Жуков", "Журавлёв", "Журов", "Жиров", "Жабин", "Жернаков",
        "Задорнов", "Зайцев", "Захаев", "Захаров", "Захарченко", "Зверёв", "Золотов", "Зубков", "Зыков", "Зюганов",
        
        "Ибрагимов", "Иванов", "Игнатьев", "Измайлов", "Ильин", "Исаев", "Истомин", "Ишутин", "Илюхин",
        
        "Каблуков", "Казаков", "Калагин", "Калинин", "Калугин", "Каменев", "Каретников", "Касьянов", "Касанов", "Катин", "Квасов",
        "Кедров", "Киреев", "Кириллов", "Киселёв", "Климов", "Князев", "Ковалевский", "Коваленко", "Ковалёв", "Ковров", "Козлов",
        "Козловский", "Колесников", "Колобков", "Колупаев", "Комаров", "Кондратьев", "Коновалов", "Константинов", "Копейкин",
        "Коржев", "Корнилов", "Коровин", "Королёв", "Костин", "Котов", "Кошкин", "Краснов", "Кривов", "Круглов", "Крылов",
        "Крымов", "Кудрин", "Кузьмин", "Куклин", "Кулаков", "Курицын", "Кустов", "Кутузов", "Косарёв", "Корнев", "Кулагин",
        
        "Лавров", "Лаврентьев", "Лазарев", "Лапин", "Ларин", "Лебедев", "Леонидов", "Леонов", "Лермонтов", "Летов", "Лисов",
        "Лобанов", "Лобов", "Логинов", "Лопатин", "Лукьянов", "Львов", "Лягушкин", "Лосев", "Лопухов", "Логиновский", "Лидин",
        
        "Макаров", "Максимов", "Маркин", "Марков", "Матвеев", "Медведев", "Милорадов", "Мирнов", "Михайлов", "Моисеев",
        "Морозов", "Мосин", "Москвин", "Мухин", "Мягков", "Мясников", "Мяукин", "Миронов", "Минаев", "Милов", "Марин",
        "Мамедов",
        
        "Назаров", "Наумов", "Невзоров", "Некрасов", "Немцов", "Нестеров", "Нечаев", "Никитин", "Николаев", "Никулин",
        "Новиков", "Носков", "Носов", "Никифоров", "Новичков", "Науменко", "Нагиев", "Норин", "Носачёв", "Набатов",
        
        "Овечкин", "Огурцов", "Озеров", "Оленев", "Онегин", "Орлов", "Осинов", "Осипов", "Островский", "Оборин",

        "Павлов", "Панин", "Панкратов", "Панфилов", "Пастернак", "Патрушев", "Пелевин", "Перевалов", "Перов",
        "Петренко", "Петров", "Пивоваров", "Пирогов", "Платонов", "Погодин", "Пожарский", "Поздняков", "Поливанов",
        "Полтанов", "Полунин", "Поляков", "Пономарёв", "Попов", "Портнов", "Преображенский", "Привалов", "Пригожин",
        "Пронин", "Проничев", "Протасов", "Прохоров", "Пугачёв", "Пугин", "Путилов", "Полторак", "Пушной", "Пушкарёв",

        "Рабинович", "Разин", "Раскалов", "Распутин", "Резниченко", "Резнов", "Репин", "Решетников", "Ржевский", "Рогачёв",
        "Рогов", "Рогозин", "Родин", "Рожков", "Розанов", "Романов", "Ростов", "Рощин", "Рудин", "Рудов", "Румянцев", "Рунов",
        "Русаков", "Рыбаков", "Рыжов", "Рыков", "Рюриков", "Рябков", "Рябов", "Рудников", "Равенов", "Ряхин", "Ручкин",

        "Савкин", "Салагин", "Салтанов", "Самарин", "Сапогов", "Сапожников", "Сафронов", "Сахаров", "Северный", "Седов", "Селезнёв",
        "Селиванов", "Семёнов", "Сенькин", "Сергеев", "Серебров", "Серебряков", "Серёгин", "Серов", "Сеченов", "Сиваков", "Сидоров",
        "Сизов", "Силин", "Симонов", "Скворцов", "Скороходков", "Славский", "Смехов", "Смирнов", "Смотров", "Снегирёв", "Соколов",
        "Солдатов", "Соловьёв", "Соломин", "Соломонов", "Сомов", "Сорокин", "Степанов", "Стрелков", "Строганов", "Суворин", "Суворов",
        "Султанов", "Суриков", "Сурков", "Суснин", "Сутулин", "Сысоев", "Сычов", "Стрельцов", "Суботин", "Стрелаков", "Степнов",

        "Табаков", "Тарасов", "Тарковский", "Татаринов", "Твардовский", "Теплов", "Теребов", "Терещенко", "Тетеренко", "Тимофеев",
        "Тимошенко", "Титов", "Тихомиров", "Тихоненко", "Тихонов", "Ткаченко", "Ткачёв", "Токарев", "Толмачёв", "Топоров",
        "Травкин", "Травников", "Третьяков", "Трифонов", "Трофимов", "Троцкий", "Троицкий", "Трусов", "Трутнев", "Тургенев", "Туров", "Тычкин",

        "Уваров", "Углов", "Ульянов", "Усатов", "Усачёв", "Усов", "Успенский", "Устинов", "Ушаков", "Утёсов", "Устюжанин",

        "Фадеев", "Федин", "Федосеев", "Федотов", "Фёдоров", "Филатов", "Филипов", "Фильченков", "Фирсов", "Фокин", "Фоменков",
        "Фомин", "Фомичёв", "Фролов", "Фурманов", "Фененко", "Фетисов", "Фанин", "Филенков", "Фонвизин", "Францев", "Фукин",

        "Хабаров", "Хабенский", "Халтурин", "Харитонов", "Харламов", "Хлебников", "Хлебов", "Хованский", "Холодов", "Хармов",

        "Цаплин", "Царёв", "Цветков", "Циолковский", "Цырюльников", "Цыганов", "Циглер", "Цертелев", "Цейтлин", "Циркунов",

        "Чадов", "Чайка", "Чайковский", "Чапаев", "Чарков", "Чепурин", "Червяков", "Черепанов", "Черкасов", "Чернаков",
        "Черников", "Чернов", "Чехов", "Чистяков", "Чичиков", "Чкалов", "Чубаров", "Чудов", "Чуприн", "Чачанов",

        "Шабуров", "Шаляпин", "Шарапов", "Шаров", "Шаронов", "Шастин", "Шедов", "Шереметьев", "Широков", "Шишкин",
        "Шмаков", "Шмелёв", "Шпак", "Шубин", "Шувалов", "Шульгин", "Шурупов", "Шухов", "Шуршалин", "Шкут", "Шигин",
        "Щеглов", "Щедрин", "Щербаков", "Щёткин", "Щукин", "Щуров", "Щедров", "Щеголев", "Щавелев",

        "Югов", "Юдин", "Юматов", "Юмашев", "Юневич", "Юрасов", "Юренев", "Юрин", "Юрков", "Юрьев", "Юсупов", "Юшков",

        -- funny
        "Ситуация", "Шуруп", "Ювелир", "Лава", "Шляпик", "Автомойка", "Гвоздь", "Шпингалеты", "Лопнули", "Пушистый",
        "Хачипури", "Нагибатов", "Дропов", "Борщ", "Шпагат", "Мармеладов", "Турбина",
    }

local fsnsx = {
    ["Цейтлин"] = true,
    ["Бейкон"] = true,
}

local fsnda = function(s, sn)
    if not s and not fsnsx[sn] then
        local ss = utf8.sub(sn, -1)
        if ss == "в" or ss == "н" then sn = sn .. "а" end
        sn = sn:gsub("ый$", "ая"):gsub("ий$", "ая"):gsub("ой$", "ая")
    end
    return sn
end

gmlfi.RandomName = function()
    local s = gmlfi.RandomBool()
    local n = s and mnames or fnames
    local sn = surnames[math.random(#surnames)]
    sn = fsnda(s, sn)
    if math.random() < .1 then sn = sn .. "-" .. fsnda(s, surnames[math.random(#surnames)]) end
    local ns = string.format("%s %s", n[math.random(#n)], sn)
    return math.random() < .1 and gmlfi.Transliterate(ns) or ns
end
gmlfi.RandomNames = function(num)
    local ret = {}
    if not num or num < 1 then return ret end

    for k = 1, num do
        ret[#ret + 1] = gmlfi.RandomName()
    end
    return ret
end

gmlfi.file = {
    _check = function() if not file.IsDir("gmlfi", "DATA") then file.CreateDir("gmlfi") end end,
    Write = function(name, content) 
        if not file.IsDir("gmlfi", "DATA") then file.CreateDir("gmlfi") end
        file.Write("gmlfi/" .. name, content)
    end,
    Read = function(name, content) 
        if not file.IsDir("gmlfi", "DATA") then file.CreateDir("gmlfi") end
        return file.Read("gmlfi/" .. name, "DATA")
    end,
    
    Exists = function(name)
        gmlfi.file._check()
        return file.Exists("gmlfi/" .. name, "DATA")
    end,
    IsDir = function(name)
        gmlfi.file._check()
        return file.IsDir("gmlfi/" .. name, "DATA")
    end,
    CreateDir = function(name)
        gmlfi.file._check()
        return file.CreateDir("gmlfi/" .. name, "DATA")
    end,
}

gmlfi.FormatTime = function(t) return string.format("%01d:%02d:%02d", math.floor(t / 3600), math.floor(t / 60) % 60, math.floor(t) % 60) end
gmlfi.FormatTimeMinutes = function(t) return string.format("%i:%05.2f", math.floor(t / 60) % 60, t % 60) end

if SERVER then
    gmlfi.AdminsRecipientFilter = function()
        local fl = RecipientFilter()
        for k, v in ipairs(player.GetHumans()) do
            if v:IsAdmin() then fl:AddPlayer(v) end
        end
        return fl
    end
end

NOTIFY_SUCCESS = 5

local TableToString
local types = {
    table = function(v, m, d) return m and d and m < d and "{...}" or TableToString(v, m, d) end,
    number = function(v) return tostring(v) end,
    string = function(v) return string.format("%q", v) end,
    Vector = function(v) return string.format("Vector(%s, %s, %s)", v.x, v.y, v.z) end,
    Angle = function(v) return string.format("Angle(%s, %s, %s)", v.x, v.y, v.z) end,
    Entity = function(v) return (IsValid(v) or v:IsWorld()) and string.format("Entity(%s) --[[%s]]", v:EntIndex(), v:GetClass()) or "Entity(-1)" end,
    Player = function(v) return IsValid(v) and string.format("Entity(%s) --[[%q]]", v:EntIndex(), v:Name()) or "Player(0)" end,
    ["function"] = function(v) local d = debug.getinfo(v) return string.format("function() --[[%q]] end", d.what == "Lua" and (d.short_src .. ":" .. (d.currentline ~= -1 and d.currentline or d.linedefined)) or d.short_src) end
}

types.Weapon = types.Entity
types.Vehicle = types.Entity

gmlfi.ValueToString = function(v, ...) local t = types[type(v)] return t and t(v, ...) or tostring(v) end

TableToString = function(c, mdepth, depth) depth = depth or 1
    local str, seq = {}, {}
    for k, v in ipairs(c) do
        seq[k] = true
        local t = types[type(v)]
        str[k] = t and t(v, mdepth, depth + 1) or ("\"" .. tostring(v) .. "\"")
    end
    for k, v in pairs(c) do
        if not seq[k] then
            local t = types[type(v)]
            local t2 = types[type(k)]
            str[#str + 1] = string.format("[%s] = %s", t2 and t2(k, mdepth, depth + 1) or tostring(k), t and t(v, mdepth, depth + 1) or tostring(v))
        end
    end

    local ts = string.rep("    ", depth)
    return "{\n" .. ts .. table.concat(str, ",\n" .. ts) .. "\n" .. string.rep("    ", depth - 1) .. "}"
end

gmlfi.TableToString = TableToString